podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/RCC_STM32F030.svd.xml
            <register>
               <name>APB2ENR</name>
               <description>APB2 peripheral clock enable register
          (RCC_APB2ENR)</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>SYSCFGEN</name>
                     <description>SYSCFG clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCEN</name>
                     <description>ADC 1 interface clock
              enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1EN</name>
                     <description>TIM1 Timer clock enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1EN</name>
                     <description>SPI 1 clock enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1EN</name>
                     <description>USART1 clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM15EN</name>
                     <description>TIM15 timer clock enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16EN</name>
                     <description>TIM16 timer clock enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17EN</name>
                     <description>TIM17 timer clock enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBGMCUEN</name>
                     <description>MCU debug module clock
              enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1ENR</name>
               <description>APB1 peripheral clock enable register
          (RCC_APB1ENR)</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>TIM3EN</name>
                     <description>Timer 3 clock enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6EN</name>
                     <description>Timer 6 clock enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM14EN</name>
                     <description>Timer 14 clock enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGEN</name>
                     <description>Window watchdog clock
              enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2EN</name>
                     <description>SPI 2 clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2EN</name>
                     <description>USART 2 clock enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1EN</name>
                     <description>I2C 1 clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2EN</name>
                     <description>I2C 2 clock enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWREN</name>
                     <description>Power interface clock
              enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDCR</name>
               <description>Backup domain control register
          (RCC_BDCR)</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>LSEON</name>
                     <description>External Low Speed oscillator
              enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSERDY</name>
                     <description>External Low Speed oscillator
              ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSEBYP</name>
                     <description>External Low Speed oscillator
              bypass</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSEDRV</name>
                     <description>LSE oscillator drive
              capability</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC clock source selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTC clock enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDRST</name>
                     <description>Backup domain software
              reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <description>Control/status register
          (RCC_CSR)</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0xC000000</resetValue>
               <fields>
                  <field>
                     <name>LSION</name>
                     <description>Internal low speed oscillator
              enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSIRDY</name>
                     <description>Internal low speed oscillator
              ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RMVF</name>
                     <description>Remove reset flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OBLRSTF</name>
                     <description>Option byte loader reset
              flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PINRSTF</name>
                     <description>PIN reset flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORRSTF</name>
                     <description>POR/PDR reset flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFTRSTF</name>
                     <description>Software reset flag</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDGRSTF</name>
                     <description>Independent watchdog reset
              flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGRSTF</name>
                     <description>Window watchdog reset flag</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPWRRSTF</name>
                     <description>Low-power reset flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHBRSTR</name>
               <description>AHB peripheral reset register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>IOPARST</name>
                     <description>I/O port A reset</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPBRST</name>
                     <description>I/O port B reset</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPCRST</name>
                     <description>I/O port C reset</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPDRST</name>
                     <description>I/O port D reset</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPFRST</name>
                     <description>I/O port F reset</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <description>Clock configuration register 2</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>PREDIV</name>
                     <description>PREDIV division factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR3</name>
               <description>Clock configuration register 3</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>USART1SW</name>
                     <description>USART1 clock source
              selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SW</name>
                     <description>I2C1 clock source
              selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCSW</name>
                     <description>ADC clock source selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SW</name>
                     <description>USART2 clock source
              selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <description>Clock control register 2</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>HSI14ON</name>
                     <description>HSI14 clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSI14RDY</name>
                     <description>HR14 clock ready flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI14DIS</name>
                     <description>HSI14 clock request from ADC
              disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSI14TRIM</name>
                     <description>HSI14 clock trimming</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>HSI14CAL</name>
                     <description>HSI14 clock calibration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI48ON</name>
                     <description>HSI48 clock enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSI48RDY</name>
                     <description>HSI48 clock ready flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI48CAL</name>
                     <description>HSI48 factory clock
              calibration</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
